In [1]:
import pandas as pd

In [2]:
s1=pd.Series([1,2,3,4,5])

In [3]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
type(s1)

pandas.core.series.Series

# changing index

In [6]:
s1=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [7]:
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [8]:
s1['d']

4

In [9]:
s1=pd.Series([1,2,3,4,5],index=['a','b','c','d','d'])

In [10]:
s1

a    1
b    2
c    3
d    4
d    5
dtype: int64

In [11]:
s1['d']

d    4
d    5
dtype: int64

In [12]:
dic={'a':20,'b':30,'c':40}

In [13]:
s1=pd.Series(dic)

In [14]:
s1

a    20
b    30
c    40
dtype: int64

In [17]:
s1=pd.Series({'a':10,'b':20,'c':30},index=['b','d','a','c'])

In [18]:
s1

b    20.0
d     NaN
a    10.0
c    30.0
dtype: float64


# Extracting Element from Series

In [19]:
l1=(x for x in range(1,11))

In [20]:
s2=pd.Series(l1)

In [21]:
s2

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [22]:
s2[3]

4

In [23]:
s2[3:9]

3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [25]:
s2[-4:]

6     7
7     8
8     9
9    10
dtype: int64

In [26]:
s2[:5]

0    1
1    2
2    3
3    4
4    5
dtype: int64

# Basic Math Operation on Series

In [28]:
s2*2

0     2
1     4
2     6
3     8
4    10
5    12
6    14
7    16
8    18
9    20
dtype: int64

In [33]:
l2=(x for x in range(10,19))

In [34]:
s3=pd.Series(l2)

In [35]:
s2+s3

0    11.0
1    13.0
2    15.0
3    17.0
4    19.0
5    21.0
6    23.0
7    25.0
8    27.0
9     NaN
dtype: float64

In [36]:
s3-s2

0    9.0
1    9.0
2    9.0
3    9.0
4    9.0
5    9.0
6    9.0
7    9.0
8    9.0
9    NaN
dtype: float64

In [37]:
s2*s3

0     10.0
1     22.0
2     36.0
3     52.0
4     70.0
5     90.0
6    112.0
7    136.0
8    162.0
9      NaN
dtype: float64

# conditional Statement

In [39]:
s2.where(s2%2==0)

0     NaN
1     2.0
2     NaN
3     4.0
4     NaN
5     6.0
6     NaN
7     8.0
8     NaN
9    10.0
dtype: float64

In [40]:
s2.where(s2%2==0,'Odd Number')

0    Odd Number
1             2
2    Odd Number
3             4
4    Odd Number
5             6
6    Odd Number
7             8
8    Odd Number
9            10
dtype: object

In [41]:
s2.where(s2%2==0,s2**2)

0     1
1     2
2     9
3     4
4    25
5     6
6    49
7     8
8    81
9    10
dtype: int64

# DAta Ferame(2 dimensional labeld data structure consist of row and column)

In [44]:
df=pd.DataFrame([1,4,7,9,11])

In [45]:
df

    0
0   1
1   4
2   7
3   9
4  11

In [46]:
df=pd.DataFrame({'name':['naveed','waseem','nadeem','asad'],'marks':[34,56,62,46]})

In [47]:
df

     name  marks
0  naveed     34
1  waseem     56
2  nadeem     62
3    asad     46

In [50]:
df['name'][2]

'nadeem'

In [52]:
df['marks'][3]

46

# load Dataset

In [53]:
df1=pd.read_csv('C:\\Users\\IDEAL COM\\Downloads\\a08a1080b88344b0c8a7-0e7a9b0a5d22642a06d3d5b9bcbad9890c8ee534\\iris.csv')

In [54]:
df1

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [55]:
df1.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [56]:
df1.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [57]:
df1.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

# iloc[]

In [59]:
df2=df1.iloc[0:3,0:2]

In [60]:
df2

   sepal_length  sepal_width
0           5.1          3.5
1           4.9          3.0
2           4.7          3.2

# loc[]

In [61]:
df3=df1.loc[0:3,('sepal_length','petal_width')]

In [62]:
df3

   sepal_length  petal_width
0           5.1          0.2
1           4.9          0.2
2           4.7          0.2
3           4.6          0.2

In [63]:
df1.drop('sepal_length',axis=1)

     sepal_width  petal_length  petal_width    species
0            3.5           1.4          0.2     setosa
1            3.0           1.4          0.2     setosa
2            3.2           1.3          0.2     setosa
3            3.1           1.5          0.2     setosa
4            3.6           1.4          0.2     setosa
..           ...           ...          ...        ...
145          3.0           5.2          2.3  virginica
146          2.5           5.0          1.9  virginica
147          3.0           5.2          2.0  virginica
148          3.4           5.4          2.3  virginica
149          3.0           5.1          1.8  virginica

[150 rows x 4 columns]

In [69]:
df1.drop([3,6],axis=0)

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
5             5.4          3.9           1.7          0.4     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[148 rows x 5 columns]

In [70]:
df1.mean()

C:\Users\IDEAL COM\AppData\Local\Temp\ipykernel_10012\2053335143.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.mean()

sepal_length    5.843333
sepal_width     3.054000
petal_length    3.758667
petal_width     1.198667
dtype: float64

In [71]:
df1.median()

C:\Users\IDEAL COM\AppData\Local\Temp\ipykernel_10012\2279417019.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.median()

sepal_length    5.80
sepal_width     3.00
petal_length    4.35
petal_width     1.30
dtype: float64

In [72]:
df1.std()

C:\Users\IDEAL COM\AppData\Local\Temp\ipykernel_10012\3039516898.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.std()

sepal_length    0.828066
sepal_width     0.433594
petal_length    1.764420
petal_width     0.763161
dtype: float64

In [73]:
df1.var()

C:\Users\IDEAL COM\AppData\Local\Temp\ipykernel_10012\2870725145.py:1: FutureWarning: The default value of numeric_only in DataFrame.var is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.var()

sepal_length    0.685694
sepal_width     0.188004
petal_length    3.113179
petal_width     0.582414
dtype: float64

In [74]:
df1.min()

sepal_length       4.3
sepal_width        2.0
petal_length       1.0
petal_width        0.1
species         setosa
dtype: object

In [75]:
df1.max()

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

# half double

In [76]:
def half(s):
    return s*0.5

In [77]:
df1[['sepal_length','sepal_width']].apply(half)

     sepal_length  sepal_width
0            2.55         1.75
1            2.45         1.50
2            2.35         1.60
3            2.30         1.55
4            2.50         1.80
..            ...          ...
145          3.35         1.50
146          3.15         1.25
147          3.25         1.50
148          3.10         1.70
149          2.95         1.50

[150 rows x 2 columns]

In [78]:
def double(s):
    return s*2

In [79]:
df1[['sepal_length','sepal_width']].apply(double)

     sepal_length  sepal_width
0            10.2          7.0
1             9.8          6.0
2             9.4          6.4
3             9.2          6.2
4            10.0          7.2
..            ...          ...
145          13.4          6.0
146          12.6          5.0
147          13.0          6.0
148          12.4          6.8
149          11.8          6.0

[150 rows x 2 columns]

In [80]:
df1['species'].value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [81]:
df1.sort_values(by='petal_width')

     sepal_length  sepal_width  petal_length  petal_width    species
32            5.2          4.1           1.5          0.1     setosa
13            4.3          3.0           1.1          0.1     setosa
37            4.9          3.1           1.5          0.1     setosa
9             4.9          3.1           1.5          0.1     setosa
12            4.8          3.0           1.4          0.1     setosa
..            ...          ...           ...          ...        ...
140           6.7          3.1           5.6          2.4  virginica
114           5.8          2.8           5.1          2.4  virginica
100           6.3          3.3           6.0          2.5  virginica
144           6.7          3.3           5.7          2.5  virginica
109           7.2          3.6           6.1          2.5  virginica

[150 rows x 5 columns]